## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_ecs_service.default[0] has changed
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
        name                               = "gost-staging-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:223" -> "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:224"
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] has been deleted
-   resource "aws_ecs_task_definition" "default" {
-       arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:223" -> null
-       arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api" -> null
-       container_definitions    = jsonencode(
            [
-               {
-                   cpu                    = 0
-                   dependsOn              = [
-                       {
-                           condition     = "START"
-                           containerName = "datadog"
                        },
                    ]
-                   dockerLabels           = {
-                       "com.datadoghq.tags.env"     = "staging"
-                       "com.datadoghq.tags.service" = "gost"
-                       "com.datadoghq.tags.version" = "1e37c37492f7443dc6543ebe82e087b7bd670ab3"
                    }
-                   environment            = [
-                       {
-                           name  = "API_DOMAIN"
-                           value = "https://api.staging.grants.usdr.dev"
                        },
-                       {
-                           name  = "ARPA_AUDIT_REPORT_SQS_QUEUE_URL"
-                           value = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-arpa_audit_report-20230929024256614400000005"
                        },
-                       {
-                           name  = "ARPA_TREASURY_REPORT_SQS_QUEUE_URL"
-                           value = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-treasury_report-20231016171215973500000008"
                        },
-                       {
-                           name  = "AUDIT_REPORT_BUCKET"
-                           value = "gost-staging-arpaauditreports-357150818708-us-west-2-api"
                        },
-                       {
-                           name  = "DATA_DIR"
-                           value = "/var/data"
                        },
-                       {
-                           name  = "DD_ENV"
-                           value = "staging"
                        },
-                       {
-                           name  = "DD_PROFILING_ENABLED"
-                           value = "true"
                        },
-                       {
-                           name  = "DD_SERVICE"
-                           value = "gost"
                        },
-                       {
-                           name  = "DD_VERSION"
-                           value = "1e37c37492f7443dc6543ebe82e087b7bd670ab3"
                        },
-                       {
-                           name  = "ENABLE_GRANTS_DIGEST"
-                           value = "false"
                        },
-                       {
-                           name  = "ENABLE_GRANTS_SCRAPER"
-                           value = "false"
                        },
-                       {
-                           name  = "ENABLE_GRANT_DIGEST_SCHEDULED_TASK"
-                           value = "true"
                        },
-                       {
-                           name  = "ENABLE_MY_PROFILE"
-                           value = "true"
                        },
-                       {
-                           name  = "ENABLE_NEW_TEAM_TERMINOLOGY"
-                           value = "true"
                        },
-                       {
-                           name  = "ENABLE_SAVED_SEARCH_GRANTS_DIGEST"
-                           value = "true"
                        },
-                       {
-                           name  = "GRANTS_SCRAPER_DATE_RANGE"
-                           value = "7"
                        },
-                       {
-                           name  = "GRANTS_SCRAPER_DELAY"
-                           value = "1000"
                        },
-                       {
-                           name  = "NEW_GRANT_DETAILS_PAGE_ENABLED"
-                           value = "true"
                        },
-                       {
-                           name  = "NODE_OPTIONS"
-                           value = "--max_old_space_size=1024"
                        },
-                       {
-                           name  = "NOTIFICATIONS_EMAIL"
-                           value = "grants-notifications@staging.grants.usdr.dev"
                        },
-                       {
-                           name  = "PGSSLROOTCERT"
-                           value = "rds-combined-ca-bundle.pem"
                        },
-                       {
-                           name  = "VUE_APP_GRANTS_API_URL"
-                           value = "https://74pah5zi58.execute-api.us-west-2.amazonaws.com"
                        },
-                       {
-                           name  = "WEBSITE_DOMAIN"
-                           value = "https://staging.grants.usdr.dev"
                        },
                    ]
-                   essential              = true
-                   image                  = "ghcr.io/usdigitalresponse/usdr-gost-api:1e37c37492f7443dc6543ebe82e087b7bd670ab3@sha256:c98b6d30a6d37f90676ee9bceefc4cb353c2b34714145940b5053a1c1b331650"
-                   linuxParameters        = {
-                       capabilities       = {
-                           add  = []
-                           drop = []
                        }
-                       devices            = []
-                       initProcessEnabled = true
-                       tmpfs              = []
                    }
-                   logConfiguration       = {
-                       logDriver = "awslogs"
-                       options   = {
-                           awslogs-group         = "gost-staging-api-20230217010414234200000007"
-                           awslogs-region        = "us-west-2"
-                           awslogs-stream-prefix = "ecs"
                        }
                    }
-                   mountPoints            = [
-                       {
-                           containerPath = "/var/data"
-                           readOnly      = false
-                           sourceVolume  = "data"
                        },
                    ]
-                   name                   = "api"
-                   portMappings           = [
-                       {
-                           containerPort = 3000
-                           hostPort      = 3000
-                           protocol      = "tcp"
                        },
                    ]
-                   readonlyRootFilesystem = false
-                   secrets                = [
-                       {
-                           name      = "COOKIE_SECRET"
-                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/api/cookie_secret"
                        },
-                       {
-                           name      = "POSTGRES_URL"
-                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/postgres/connection_string"
                        },
                    ]
-                   systemControls         = []
-                   volumesFrom            = []
                },
-               {
-                   cpu                    = 0
-                   dockerLabels           = {
-                       "com.datadoghq.tags.env"     = "staging"
-                       "com.datadoghq.tags.service" = "gost"
-                       "com.datadoghq.tags.version" = "1e37c37492f7443dc6543ebe82e087b7bd670ab3"
                    }
-                   environment            = [
-                       {
-                           name  = "DD_APM_ENABLED"
-                           value = "true"
                        },
-                       {
-                           name  = "DD_ENV"
-                           value = "staging"
                        },
-                       {
-                           name  = "DD_PROFILING_ENABLED"
-                           value = "true"
                        },
-                       {
-                           name  = "DD_SERVICE"
-                           value = "gost"
                        },
-                       {
-                           name  = "DD_VERSION"
-                           value = "1e37c37492f7443dc6543ebe82e087b7bd670ab3"
                        },
-                       {
-                           name  = "ECS_FARGATE"
-                           value = "true"
                        },
                    ]
-                   essential              = false
-                   image                  = "public.ecr.aws/datadog/agent:latest"
-                   mountPoints            = []
-                   name                   = "datadog"
-                   portMappings           = []
-                   readonlyRootFilesystem = false
-                   secrets                = [
-                       {
-                           name      = "DD_API_KEY"
-                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key"
                        },
                    ]
-                   stopTimeout            = 60
-                   systemControls         = []
-                   volumesFrom            = []
                },
            ]
        ) -> null
-       cpu                      = "256" -> null
-       execution_role_arn       = "arn:aws:iam::357150818708:role/gost-staging-api-ECSTaskExecution-20230217010414321500000009" -> null
-       family                   = "gost-staging-api" -> null
-       id                       = "gost-staging-api" -> null
-       memory                   = "512" -> null
-       network_mode             = "awsvpc" -> null
-       requires_compatibilities = [
-           "FARGATE",
        ] -> null
-       revision                 = 223 -> null
-       skip_destroy             = false -> null
-       tags_all                 = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "usdr-gost"
-           "service"    = "gost"
-           "usage"      = "workload"
        } -> null
-       task_role_arn            = "arn:aws:iam::357150818708:role/gost-staging-api-ECSTask-2023021701041477300000000a" -> null

-       runtime_platform {
-           cpu_architecture        = "ARM64" -> null
-           operating_system_family = "LINUX" -> null
        }

-       volume {
-           name = "data" -> null

-           efs_volume_configuration {
-               file_system_id     = "fs-08f95063c1cdbe191" -> null
-               root_directory     = "/" -> null
-               transit_encryption = "ENABLED" -> null

-               authorization_config {
-                   access_point_id = "fsap-03bc0296928aade4f" -> null
                }
            }
        }
    }

  # module.api.aws_iam_role.execution[0] has changed
  ~ resource "aws_iam_role" "execution" {
        id                    = "gost-staging-api-ECSTaskExecution-20230217010414321500000009"
        name                  = "gost-staging-api-ECSTaskExecution-20230217010414321500000009"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2024-04-09T17:15:16Z" -> "2024-04-09T18:16:07Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.api.aws_iam_role.task[0] has changed
  ~ resource "aws_iam_role" "task" {
        id                    = "gost-staging-api-ECSTask-2023021701041477300000000a"
        name                  = "gost-staging-api-ECSTask-2023021701041477300000000a"
      ~ role_last_used        = [
          ~ {
              ~ last_used_date = "2024-04-09T16:19:10Z" -> "2024-04-09T17:42:26Z"
                # (1 unchanged element hidden)
            },
        ]
        tags                  = {}
        # (11 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.arpa_audit_report.aws_ecs_task_definition.consumer has been deleted
-   resource "aws_ecs_task_definition" "consumer" {
-       arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-arpa_audit_report:192" -> null
        id                       = "gost-staging-arpa_audit_report"
        # (14 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.arpa_treasury_report.aws_ecs_task_definition.consumer has been deleted
-   resource "aws_ecs_task_definition" "consumer" {
-       arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-treasury_report:181" -> null
        id                       = "gost-staging-treasury_report"
        # (14 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.consume_grants.aws_ecs_task_definition.consume_grants has been deleted
-   resource "aws_ecs_task_definition" "consume_grants" {
-       arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants:208" -> null
        id                       = "gost-staging-consume_grants"
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.api.module.grant_digest_scheduled_task.aws_scheduler_schedule.default[0] has changed
  ~ resource "aws_scheduler_schedule" "default" {
        id                           = "default/gost-staging-grant-digest-task20240404183105743500000002"
        name                         = "gost-staging-grant-digest-task20240404183105743500000002"
        # (10 unchanged attributes hidden)

      ~ target {
            # (3 unchanged attributes hidden)

          ~ ecs_parameters {
                tags                    = {}
              ~ task_definition_arn     = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:223" -> "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:224"
                # (8 unchanged attributes hidden)

                # (1 unchanged block hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.aws_ecs_service.default[0] will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-api"
        name                               = "gost-staging-api"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-api:224" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.api.aws_ecs_task_definition.default[0] will be created
+   resource "aws_ecs_task_definition" "default" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = jsonencode(
            [
+               {
+                   cpu                    = 0
+                   dependsOn              = [
+                       {
+                           condition     = "START"
+                           containerName = "datadog"
                        },
                    ]
+                   dockerLabels           = {
+                       "com.datadoghq.tags.env"     = "staging"
+                       "com.datadoghq.tags.service" = "gost"
+                       "com.datadoghq.tags.version" = "1ca1e2e939308df04ce064629a646459a0da2ced"
                    }
+                   environment            = [
+                       {
+                           name  = "API_DOMAIN"
+                           value = "https://api.staging.grants.usdr.dev"
                        },
+                       {
+                           name  = "ARPA_AUDIT_REPORT_SQS_QUEUE_URL"
+                           value = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-arpa_audit_report-20230929024256614400000005"
                        },
+                       {
+                           name  = "ARPA_TREASURY_REPORT_SQS_QUEUE_URL"
+                           value = "https://sqs.us-west-2.amazonaws.com/357150818708/gost-staging-treasury_report-20231016171215973500000008"
                        },
+                       {
+                           name  = "AUDIT_REPORT_BUCKET"
+                           value = "gost-staging-arpaauditreports-357150818708-us-west-2-api"
                        },
+                       {
+                           name  = "DATA_DIR"
+                           value = "/var/data"
                        },
+                       {
+                           name  = "DD_ENV"
+                           value = "staging"
                        },
+                       {
+                           name  = "DD_PROFILING_ENABLED"
+                           value = "true"
                        },
+                       {
+                           name  = "DD_SERVICE"
+                           value = "gost"
                        },
+                       {
+                           name  = "DD_VERSION"
+                           value = "1ca1e2e939308df04ce064629a646459a0da2ced"
                        },
+                       {
+                           name  = "ENABLE_GRANTS_DIGEST"
+                           value = "false"
                        },
+                       {
+                           name  = "ENABLE_GRANTS_SCRAPER"
+                           value = "false"
                        },
+                       {
+                           name  = "ENABLE_GRANT_DIGEST_SCHEDULED_TASK"
+                           value = "true"
                        },
+                       {
+                           name  = "ENABLE_MY_PROFILE"
+                           value = "true"
                        },
+                       {
+                           name  = "ENABLE_NEW_TEAM_TERMINOLOGY"
+                           value = "true"
                        },
+                       {
+                           name  = "ENABLE_SAVED_SEARCH_GRANTS_DIGEST"
+                           value = "true"
                        },
+                       {
+                           name  = "GRANTS_SCRAPER_DATE_RANGE"
+                           value = "7"
                        },
+                       {
+                           name  = "GRANTS_SCRAPER_DELAY"
+                           value = "1000"
                        },
+                       {
+                           name  = "NEW_GRANT_DETAILS_PAGE_ENABLED"
+                           value = "true"
                        },
+                       {
+                           name  = "NODE_OPTIONS"
+                           value = "--max_old_space_size=1024"
                        },
+                       {
+                           name  = "NOTIFICATIONS_EMAIL"
+                           value = "grants-notifications@staging.grants.usdr.dev"
                        },
+                       {
+                           name  = "PGSSLROOTCERT"
+                           value = "rds-combined-ca-bundle.pem"
                        },
+                       {
+                           name  = "VUE_APP_GRANTS_API_URL"
+                           value = "https://74pah5zi58.execute-api.us-west-2.amazonaws.com"
                        },
+                       {
+                           name  = "WEBSITE_DOMAIN"
+                           value = "https://staging.grants.usdr.dev"
                        },
                    ]
+                   essential              = true
+                   image                  = "ghcr.io/usdigitalresponse/usdr-gost-api:1ca1e2e939308df04ce064629a646459a0da2ced@sha256:ac3356c71cafab5d6e60129170d186e15ed7c85a38eb1c2cdf16e27e8fdffe0e"
+                   linuxParameters        = {
+                       capabilities       = {
+                           add  = []
+                           drop = []
                        }
+                       devices            = []
+                       initProcessEnabled = true
+                       tmpfs              = []
                    }
+                   logConfiguration       = {
+                       logDriver = "awslogs"
+                       options   = {
+                           awslogs-group         = "gost-staging-api-20230217010414234200000007"
+                           awslogs-region        = "us-west-2"
+                           awslogs-stream-prefix = "ecs"
                        }
                    }
+                   mountPoints            = [
+                       {
+                           containerPath = "/var/data"
+                           readOnly      = false
+                           sourceVolume  = "data"
                        },
                    ]
+                   name                   = "api"
+                   portMappings           = [
+                       {
+                           containerPort = 3000
+                           hostPort      = 3000
+                           protocol      = "tcp"
                        },
                    ]
+                   readonlyRootFilesystem = false
+                   secrets                = [
+                       {
+                           name      = "COOKIE_SECRET"
+                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/api/cookie_secret"
                        },
+                       {
+                           name      = "POSTGRES_URL"
+                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/postgres/connection_string"
                        },
                    ]
                },
+               {
+                   cpu                    = 0
+                   dockerLabels           = {
+                       "com.datadoghq.tags.env"     = "staging"
+                       "com.datadoghq.tags.service" = "gost"
+                       "com.datadoghq.tags.version" = "1ca1e2e939308df04ce064629a646459a0da2ced"
                    }
+                   environment            = [
+                       {
+                           name  = "DD_APM_ENABLED"
+                           value = "true"
                        },
+                       {
+                           name  = "DD_ENV"
+                           value = "staging"
                        },
+                       {
+                           name  = "DD_PROFILING_ENABLED"
+                           value = "true"
                        },
+                       {
+                           name  = "DD_SERVICE"
+                           value = "gost"
                        },
+                       {
+                           name  = "DD_VERSION"
+                           value = "1ca1e2e939308df04ce064629a646459a0da2ced"
                        },
+                       {
+                           name  = "ECS_FARGATE"
+                           value = "true"
                        },
                    ]
+                   essential              = false
+                   image                  = "public.ecr.aws/datadog/agent:latest"
+                   name                   = "datadog"
+                   readonlyRootFilesystem = false
+                   secrets                = [
+                       {
+                           name      = "DD_API_KEY"
+                           valueFrom = "arn:aws:ssm:us-west-2:357150818708:parameter/gost/staging/datadog/api_key"
                        },
                    ]
+                   stopTimeout            = 60
                },
            ]
        )
+       cpu                      = "256"
+       execution_role_arn       = "arn:aws:iam::357150818708:role/gost-staging-api-ECSTaskExecution-20230217010414321500000009"
+       family                   = "gost-staging-api"
+       id                       = (known after apply)
+       memory                   = "512"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       task_role_arn            = "arn:aws:iam::357150818708:role/gost-staging-api-ECSTask-2023021701041477300000000a"

+       runtime_platform {
+           cpu_architecture        = "ARM64"
+           operating_system_family = "LINUX"
        }

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }
    }

  # module.arpa_audit_report.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-arpa_audit_report"
        name                               = "gost-staging-arpa_audit_report"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-arpa_audit_report:193" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.arpa_audit_report.aws_ecs_task_definition.consumer will be created
+   resource "aws_ecs_task_definition" "consumer" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = (sensitive value)
+       cpu                      = "1024"
+       execution_role_arn       = "arn:aws:iam::357150818708:role/gost-staging-arpa_audit_report-Exec-20230929024256716900000007"
+       family                   = "gost-staging-arpa_audit_report"
+       id                       = (known after apply)
+       memory                   = "4096"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       task_role_arn            = "arn:aws:iam::357150818708:role/gost-staging-arpa_audit_report-Task-20230929024256613500000004"

+       runtime_platform {
+           cpu_architecture        = "ARM64"
+           operating_system_family = "LINUX"
        }

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }
    }

  # module.arpa_treasury_report.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-treasury_report"
        name                               = "gost-staging-treasury_report"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-treasury_report:182" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.arpa_treasury_report.aws_ecs_task_definition.consumer will be created
+   resource "aws_ecs_task_definition" "consumer" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = (sensitive value)
+       cpu                      = "1024"
+       execution_role_arn       = "arn:aws:iam::357150818708:role/gost-staging-treasury_report-Exec-20231016171215972600000007"
+       family                   = "gost-staging-treasury_report"
+       id                       = (known after apply)
+       memory                   = "4096"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       task_role_arn            = "arn:aws:iam::357150818708:role/gost-staging-treasury_report-Task-20231016171215961700000003"

+       runtime_platform {
+           cpu_architecture        = "ARM64"
+           operating_system_family = "LINUX"
        }

+       volume {
+           name = "data"

+           efs_volume_configuration {
+               file_system_id     = "fs-08f95063c1cdbe191"
+               root_directory     = "/"
+               transit_encryption = "ENABLED"

+               authorization_config {
+                   access_point_id = "fsap-03bc0296928aade4f"
                }
            }
        }
    }

  # module.consume_grants.aws_ecs_service.default will be updated in-place
  ~ resource "aws_ecs_service" "default" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/gost-staging/gost-staging-consume_grants"
        name                               = "gost-staging-consume_grants"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/gost-staging-consume_grants:209" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.consume_grants.aws_ecs_task_definition.consume_grants will be created
+   resource "aws_ecs_task_definition" "consume_grants" {
+       arn                      = (known after apply)
+       arn_without_revision     = (known after apply)
+       container_definitions    = (sensitive value)
+       cpu                      = "256"
+       execution_role_arn       = "arn:aws:iam::357150818708:role/gost-staging-consume_grants-ECS-20230713221152507400000007"
+       family                   = "gost-staging-consume_grants"
+       id                       = (known after apply)
+       memory                   = "512"
+       network_mode             = "awsvpc"
+       requires_compatibilities = [
+           "FARGATE",
        ]
+       revision                 = (known after apply)
+       skip_destroy             = false
+       tags_all                 = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       task_role_arn            = "arn:aws:iam::357150818708:role/gost-staging-consume_grants-ECSTask-20230713221152510500000008"

+       runtime_platform {
+           cpu_architecture        = "ARM64"
+           operating_system_family = "LINUX"
        }
    }

  # module.website.aws_s3_object.deploy-config[0] will be updated in-place
  ~ resource "aws_s3_object" "deploy-config" {
      ~ content                = <<-EOT
            window.APP_CONFIG = window.APP_CONFIG || {};
            window.APP_CONFIG.apiURLForGOST = 'https://api.staging.grants.usdr.dev/';
            window.apiURLForGOST = window.APP_CONFIG.apiURLForGOST; // Legacy
            
            window.APP_CONFIG.DD_RUM_ENABLED = true;
-           window.APP_CONFIG.DD_RUM_CONFIG = {"allowedTracingUrls":["https://api.staging.grants.usdr.dev"],"applicationId":"15db471e-2ccb-4d3c-a6bf-99b750d748f5","clientToken":"pub50834fcc1999d53e546519b1a0f03934","defaultPrivacyLevel":"mask","env":"staging","service":"gost","sessionReplaySampleRate":100,"sessionSampleRate":100,"site":"datadoghq.com","trackLongTasks":true,"trackResources":true,"trackUserInteractions":true,"version":"1e37c37492f7443dc6543ebe82e087b7bd670ab3"};
+           window.APP_CONFIG.DD_RUM_CONFIG = {"allowedTracingUrls":["https://api.staging.grants.usdr.dev"],"applicationId":"15db471e-2ccb-4d3c-a6bf-99b750d748f5","clientToken":"pub50834fcc1999d53e546519b1a0f03934","defaultPrivacyLevel":"mask","env":"staging","service":"gost","sessionReplaySampleRate":100,"sessionSampleRate":100,"site":"datadoghq.com","trackLongTasks":true,"trackResources":true,"trackUserInteractions":true,"version":"1ca1e2e939308df04ce064629a646459a0da2ced"};
            
            window.APP_CONFIG.GOOGLE_TAG_ID = 'G-D5DFR7BN0N';
            
            window.APP_CONFIG.featureFlags = {"myProfileEnabled":true,"newGrantsDetailPageEnabled":true,"newTerminologyEnabled":true};
            
            window.APP_CONFIG.overrideFeatureFlag = (flagName, overrideValue) => {
              const storageKey = 'featureFlags';
              let overrides = {};
              try {
                overrides = JSON.parse(window.sessionStorage.getItem(storageKey)) || {};
              } catch (e) {
                console.error(`Error parsing window.sessionStorage.${storageKey} as JSON:`, e);
                console.warn(`window.sessionStorage.${storageKey} will be replaced.`);
              }
              overrides[flagName] = overrideValue;
              window.sessionStorage.setItem(storageKey, JSON.stringify(overrides));
              console.log('New feature flag overrides in page session:',
                window.sessionStorage.getItem(storageKey));
            };
        EOT
      ~ etag                   = "fa4bfb6911affd52a20a42441e004b6f" -> "471461c24deddc39e6a23fe2d9905047"
        id                     = "/config/deploy-config.js"
        tags                   = {}
      ~ version_id             = "yYG4SoLZeDBpq7lCJpfjHmqJL3tw5CJM" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.origin_dist_artifact["arpa_reporter/index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "1770e38a960b35b1961cb35cfedd2f13" -> "91ad685ad1a4d3125be0e59a403848af"
        id                     = "dist/arpa_reporter/index.html"
      ~ source_hash            = "4954e32a3f051ea3b591635a2c73dbce" -> "91ad685ad1a4d3125be0e59a403848af"
        tags                   = {}
      ~ version_id             = "3gnTouiXUltNMnCme4cVHCAeBSC4Mma0" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "4ff065161d163709fa3ec9d69d4bec3a" -> "7e75bfe4833fbc98f3160d9126212175"
        id                     = "dist/index.html"
      ~ source_hash            = "ccef69c7a246bbee7b2b78e7b0f670f5" -> "7e75bfe4833fbc98f3160d9126212175"
        tags                   = {}
      ~ version_id             = "HYhB7tYDmJFK7zljHR3bSujT5WHRuk0U" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/131.7e57803b.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "40dacfaebf4825ca990c5724fab5cf89"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/131.7e57803b.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/131.7e57803b.js"
+       source_hash            = "40dacfaebf4825ca990c5724fab5cf89"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/131.7e57803b.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "1046ebe65a7434e1bf16bd71236e3a3c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/131.7e57803b.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/131.7e57803b.js.map"
+       source_hash            = "1046ebe65a7434e1bf16bd71236e3a3c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/223.0a091128.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f0ac98820236e847d3e95c2b3a6448b3"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/223.0a091128.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/223.0a091128.js"
+       source_hash            = "f0ac98820236e847d3e95c2b3a6448b3"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/223.0a091128.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "c8beb63b5f9b6b8422d73bd1ac8b2697"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/223.0a091128.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/223.0a091128.js.map"
+       source_hash            = "c8beb63b5f9b6b8422d73bd1ac8b2697"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/40.a995f95b.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "611ff824c2c5e61f577e7264353006f9"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/40.a995f95b.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/40.a995f95b.js"
+       source_hash            = "611ff824c2c5e61f577e7264353006f9"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/40.a995f95b.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "39103a491dc92336ce52226053b887e8"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/40.a995f95b.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/40.a995f95b.js.map"
+       source_hash            = "39103a491dc92336ce52226053b887e8"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/439.44eae277.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "6a973b9a9c78c6743850167502063d5c"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/439.44eae277.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/439.44eae277.js"
+       source_hash            = "6a973b9a9c78c6743850167502063d5c"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/439.44eae277.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "c219f512e35173b487dbfd7e132219a6"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/439.44eae277.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/439.44eae277.js.map"
+       source_hash            = "c219f512e35173b487dbfd7e132219a6"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/466.ca7f7296.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "0b89e9b4ca4a94f88da614295dfea84f"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/466.ca7f7296.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/466.ca7f7296.js"
+       source_hash            = "0b89e9b4ca4a94f88da614295dfea84f"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/466.ca7f7296.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "6bcb61cd1bf56082476d0e43ab9464b2"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/466.ca7f7296.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/466.ca7f7296.js.map"
+       source_hash            = "6bcb61cd1bf56082476d0e43ab9464b2"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/582.401996c8.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "884d9ce7acec8775b282ff92369833e0"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/582.401996c8.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/582.401996c8.js"
+       source_hash            = "884d9ce7acec8775b282ff92369833e0"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/582.401996c8.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "650cf1e9d65b3cbf5622aee66bfa0251"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/582.401996c8.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/582.401996c8.js.map"
+       source_hash            = "650cf1e9d65b3cbf5622aee66bfa0251"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/584.2f494959.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "37e9f2e515a48c7d0d704bad8f8b7d73"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/584.2f494959.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/584.2f494959.js"
+       source_hash            = "37e9f2e515a48c7d0d704bad8f8b7d73"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/584.2f494959.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "e0ed71c77a619311a0d723559a0d9745"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/584.2f494959.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/584.2f494959.js.map"
+       source_hash            = "e0ed71c77a619311a0d723559a0d9745"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/641.d261cd52.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "f8b3af1ebb8021f55660b6f6e47c3710"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/641.d261cd52.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/641.d261cd52.js"
+       source_hash            = "f8b3af1ebb8021f55660b6f6e47c3710"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/641.d261cd52.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "960390b157845b5f9bcd66e2956573fe"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/641.d261cd52.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/641.d261cd52.js.map"
+       source_hash            = "960390b157845b5f9bcd66e2956573fe"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/775.77fed61f.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "6c5ee3bf69e37b6c37016a0cafe3bcf7"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/775.77fed61f.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/775.77fed61f.js"
+       source_hash            = "6c5ee3bf69e37b6c37016a0cafe3bcf7"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/775.77fed61f.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "4cf1b0f4266fc660b446bdd2e69e80de"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/775.77fed61f.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/775.77fed61f.js.map"
+       source_hash            = "4cf1b0f4266fc660b446bdd2e69e80de"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/860.b8f45476.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "64f36edbd7d74885bff580cd3345cd25"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/860.b8f45476.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/860.b8f45476.js"
+       source_hash            = "64f36edbd7d74885bff580cd3345cd25"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/860.b8f45476.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "e96a6bcc7c13d92a8fad0939cb0c8b28"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/860.b8f45476.js.map"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/860.b8f45476.js.map"
+       source_hash            = "e96a6bcc7c13d92a8fad0939cb0c8b28"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/861.75299411.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "700a3195bd17393de1d87a9d376f4195"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/861.75299411.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/usdr-gost/usdr-gost/packages/client/dist/js/861.75299411.js"
+       source_hash            = "700a3195bd17393de1d87a9d376f4195"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "usdr-gost"
+           "service"    = "gost"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.website.aws_s3_object.origin_dist_artifact["js/861.75299411.js.map"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = "private"
+       bucket                 = "gost-staging-origin-357150818708-us-west-2-website"
+       bucket_key_enabled     = (known after apply)
+       content_type           = "application/json"
+       etag                   = "0a5932f588f5eb266453a5dfe2c20305"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/js/861.75299411.js.map"
+       kms_key_id             = (known after apply)
+       server_sid...*[Comment body truncated]*